In [1]:
import seaborn as sns
import pandas as pd
import os
import sys
sys.path.append("../")
from datapath import base_path, data_path

In [2]:
titanic = sns.load_dataset("titanic")

In [3]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [4]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [5]:
import numpy as np

In [11]:
def count_missing(vec):
    null_vec = pd.isnull(vec)
    #print(null_vec.shape)
    null_count = np.sum(null_vec)
    return null_count

In [12]:
cmis_col = titanic.apply(count_missing)
print(cmis_col)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [15]:
def prop_missing(vec):
    num = count_missing(vec)
    dem = vec.size
    return num / dem * 100

In [16]:
pmis_col = titanic.apply(prop_missing)
print(pmis_col)

survived        0.000000
pclass          0.000000
sex             0.000000
age            19.865320
sibsp           0.000000
parch           0.000000
fare            0.000000
embarked        0.224467
class           0.000000
who             0.000000
adult_male      0.000000
deck           77.216611
embark_town     0.224467
alive           0.000000
alone           0.000000
dtype: float64

In [22]:
def prop_complete(vec):
    return 100 - prop_missing(vec)

In [23]:
cmis_row = titanic.apply(count_missing, axis = 1)
pmis_row = titanic.apply(prop_missing, axis=1)
pcom_row = titanic.apply(prop_complete, axis=1)

In [24]:
print(cmis_row.head())

0    1
1    0
2    1
3    0
4    1
dtype: int64

In [25]:
print(pmis_row.head())

0    6.666667
1    0.000000
2    6.666667
3    0.000000
4    6.666667
dtype: float64

In [26]:
print(pcom_row.head())

0     93.333333
1    100.000000
2     93.333333
3    100.000000
4     93.333333
dtype: float64

In [27]:
titanic["num_missing"] = titanic.apply(count_missing, axis=1)

In [28]:
print(titanic.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone  num_missing
0    man        True  NaN  Southampton    no  False            1
1  woman       False    C    Cherbourg   yes  False            0
2  woman       False  NaN  Southampton   yes   True            1
3  woman       False    C  Southampton   yes  False            0
4    man        True  NaN  Southampton    no   True            1

In [29]:
print(titanic.loc[titanic.num_missing > 1, :].sample(10))

     survived  pclass     sex  age  sibsp  parch     fare embarked   class  \
367         1       3  female  NaN      0      0   7.2292        C   Third
760         0       3    male  NaN      0      0  14.5000        S   Third
538         0       3    male  NaN      0      0  14.5000        S   Third
524         0       3    male  NaN      0      0   7.2292        C   Third
485         0       3  female  NaN      3      1  25.4667        S   Third
415         0       3  female  NaN      0      0   8.0500        S   Third
697         1       3  female  NaN      0      0   7.7333        Q   Third
451         0       3    male  NaN      1      0  19.9667        S   Third
304         0       3    male  NaN      0      0   8.0500        S   Third
481         0       2    male  NaN      0      0   0.0000        S  Second

       who  adult_male deck  embark_town alive  alone  num_missing
367  woman       False  NaN    Cherbourg   yes   True            2
760    man        True  NaN  Southampton    no   True            2
538    man        True  NaN  Southampton    no   True            2
524    man        True  NaN    Cherbourg    no   True            2
485  woman       False  NaN  Southampton    no  False            2
415  woman       False  NaN  Southampton    no   True            2
697  woman       False  NaN   Queenstown   yes   True            2
451    man        True  NaN  Southampton    no  False            2
304    man        True  NaN  Southampton    no   True            2
481    man        True  NaN  Southampton    no   True            2